/*
 * @@description:
 * @Author: 李星辰 xingchen@carbonstop.net
 * @Date: 2022-04-24 16:32:43
 * @LastEditors: qifeng qifeng@carbonstop.net
 * @LastEditTime: 2023-02-13 19:20:25
 */
/**
 * @file 协议页面
 */
import './agreement.less';
import { useHistory } from 'react-router-dom';

export enum Agreements {
  '/agreement' = '隐私协议',
  '隐私协议' = '/agreement',
  '服务协议' = '/server-agreement',
  '/server-agreement' = '服务协议',
}
const newList = `<p><strong>碳云-隐私政策</strong></p>
<p>最新版本更新日期：【2026】年【1】 月【23】日</p>
<p>最新版本生效日期：【2026】年【1】 月【23】日</p>
<p><strong>引言</strong></p>
<p>欢迎您使用我们的产品和服务！碳阻迹（北京）科技有限公司（以下简称&ldquo;<strong>碳阻迹</strong>&rdquo;或者&ldquo;我们&rdquo;）深知个人信息对您的重要性，我们将根据法律法规要求尊重并保护所有使用我们提供的碳阻迹服务的用户（以下简称&ldquo;<strong>您</strong>&rdquo;）的个人隐私权。为了给您提供更准确、更有个性化的服务，我们会按照《隐私政策》（以下简称&ldquo;<strong>本政策</strong>&rdquo;或&ldquo;<strong>本隐私政策</strong>&rdquo;）的约定处理和使用您的个人信息。</p>
<p><strong>本政策将帮助您了解以下内容：</strong></p>
<p>一、我们如何收集和使用您的个人信息</p>
<p>二、我们如何使用 Cookie 和同类技术</p>
<p>三、我们如何共享、转让和公开披露您的个人信息</p>
<p>四、我们如何保存和保护您的个人信息</p>
<p>五、您的权利</p>
<p>六、我们如何处理未成年人的个人信息</p>
<p>七、本政策如何更新</p>
<p>八、如何联系我们</p>
<p>本隐私政策适用于碳阻迹官方网站及/或使用碳阻迹提供的所有产品和服务。</p>
<p>我们将在遵守国家法律法规规定的前提下，以向您提供碳阻迹的产品及服务并不断提升产品及服务质量为目的收集、使用、共享您的个人信息，同时我们将全力保障您的个人信息安全。</p>
<p>请在使用我们的产品(或服务)前，仔细阅读并了解本《隐私政策》，特别是<strong>以粗体/粗体下划线</strong>标识的条款，您应重点阅读，确认您充分理解并同意后再开始使用。</p>
<p><strong>定义</strong></p>
<p><strong>Definition</strong></p>
<ol>
<li><strong>碳阻迹：</strong>指研发并提供碳阻迹产品和服务的主体，即碳阻迹（北京）科技有限公司，以及现在或未来设立的相关关联公司的单称或合称。</li>
<li><strong>碳阻迹产品/服务：</strong>是指由碳阻迹开发和服务的组织碳核算、产品碳足迹、绿色会议、碳账户、碳中和、碳认证、AI Agent、工作台等碳云SaaS产品，帮助客户进行安全、高效的碳数据量化服务，助力企业绿色可持续发展；为本服务协议之目的，AI Agent是指由碳阻迹以网页、应用程序（可能含不同版本）、浏览器插件、供第三方网站和应用程序使用软件开发工具包（SDK）、应用程序编程接口（API）等以及随技术发展出现的创新形态方式向您提供的以生成式人工智能服务为核心的产品与服务（&ldquo;<strong>AI Agent</strong>&rdquo;）。无论&ldquo;产品/服务&rdquo;属于上述何种情形，本隐私政策都将予以适用。</li>
<li><strong>碳阻迹网站：</strong>碳阻迹为用户提供服务的互联网网址为官网(www.carbonstop.com)、碳云SaaS(saas.carbonstop.com)。</li>
</ol>
<p><strong>4、个人信息：</strong>指以电子或者其他方式记录的已识别或者与可识别的自然人有关的各种信息，不包括匿名化处理后的信息。</p>
<p><strong>5、敏感个人信息：</strong>指一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。在本隐私政策中还包括：网络行踪轨迹、精确定位信息、交易记录。</p>
<p><strong>6、个人信息删除：</strong>指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。</p>
<ol>
<li><strong>我们如何收集和使用您的个人信息</strong></li>
</ol>
<p>为了向您提供碳阻迹产品和/或服务的基本功能，我们需要处理您的必要的个人信息，如您拒绝提供前述必要信息，您将无法正常使用碳阻迹产品和/或服务的基本功能。对于您可选填或选择提供的个人信息，如您拒绝提供，我们可能无法向您提供依赖该等信息的部分特定功能，但并不会影响您正常使用碳阻迹产品和/或服务的基本功能。</p>
<p>碳阻迹会遵循正当、合法、必要的原则，在以下提供碳阻迹产品和/或服务的场景中收集您的个人信息。如您提供的个人信息非本人信息，您应确保您已获得该人的授权同意。</p>
<p><strong>（一）服务信息展示</strong></p>
<p>当您使用碳阻迹服务时，为保障您正常使用我们的服务，我们会收集您的<strong>设备名称（包括别名）、设备型号、操作系统、IP地址、设备软件版本信息、设备识别码、设备标识码、信息所在地区、网络使用习惯以及其他与碳阻迹服务相关的日志信息</strong>，这类信息是为提供服务必须收集的基础信息，如您不同意我们记录前述信息，可能无法完成风控验证。</p>
<p><strong>请注意，单独的设备信息、日志信息是无法识别特定自然人身份的信息。</strong>如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。</p>
<p><strong>（二）账号注册</strong></p>
<p>在注册使用碳阻迹服务时，您需要提供<strong>手机号、邮箱、姓名、公司名称、密码或验证码</strong>用于创建账户完成注册，如您在使用过程中对账户信息进行修改，该修改信息也会同步至您的账号中。如您不同意提供上述信息，我们将无法为您创建账户并正常向您提供服务。对于需要通过登录账号才能使用的服务，我们可能会根据您提供的上述信息校验您的身份，确保我们是在为您本人提供服务。</p>
<p><strong>（三）快捷登录</strong></p>
<p>您使用手机号码或邮箱登录时，我们会向您预留的手机号或邮箱发送验证码以便于您快捷的完成登录，并保证您账号的安全性。</p>
<p><strong>（四）消息推送</strong></p>
<p>您需要填写<strong>邮箱地址</strong>，我们会通过邮件、站内信的方式，根据您使用服务的实际情况来分类推送服务信息。如：供应商管理、任务提醒等。如您不提供相关信息，我们将无法正常为您提供上述服务。</p>
<p><strong>（五）客服及争议处理</strong></p>
<p>当您与我们联系时，我们可能会保存您的<strong>通信/通话记录和内容</strong>或您留下的<strong>联系方式信息</strong>，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。</p>
<p><strong>（六）用户邀请</strong></p>
<p>当您邀请其他用户加入我们时，您需要在获得对方合法有效授权后填写对方的<strong>姓名、手机号或是邮箱地址</strong>，这些信息仅会被用来给您的联系人发出邀请或是其他信息之用。您也可以自行为您的联系人填加一些个人信息，但是我们保证这些信息仅会被您看到。您为您联系人所填信息也符合此隐私政策。</p>
<p><strong>（七）生成式人工智能</strong></p>
<p>在您使用产品碳足迹 AI Agent相关功能服务时，我们将收集您与AI Agent进行交互过程中所输入的内容（包括但不限于文本、图片、文件、语音），我们会对上述信息进行分析与计算，以便于更好地理解您的问题和上下文语境，从而为您提供更具有相关性的信息内容，以提供智能对话服务。特别的，我们不会从您向我们提供的语音输入或照片中，提取或挖掘声纹、面部识别信息，以及其他用于识别特定个人身份的独特生物特征或标识。</p>
<p>为向您提供连续、高质量的服务，<strong>在经安全加密技术处理和去标识化前提下，我们可能会将服务所收集的输入及对应输出，用于AI Agent的模型训练和服务的优化。</strong>同时，我们建议您不要在智能对话中主动输入您的个人敏感信息。如您主动输入的信息包含他人的个人信息，请您务必在输入前取得他人的合法授权，避免造成他人个人信息的不当泄露</p>
<p><strong>（八）其他用途</strong></p>
<p>我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。</p>
<p><strong>（九）征得授权同意的例外</strong></p>
<p>根据相关法律法规规定，以下情形中收集及使用您的个人信息无需征得您的授权同意：</p>
<ol>
<li>与国家安全、国防安全有关的；</li>
<li>与公共安全、公共卫生、重大公共利益有关的；</li>
<li>与犯罪侦查、起诉、审判和判决执行有关的；</li>
<li>出于维护个人信息主体或其他个人的生命、财产重大合法权益但又很难得到您本人同意的；</li>
<li>所收集的个人信息是您自行向社会公众公开的；</li>
<li>从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开渠道；</li>
<li>根据您的要求签订合同所必需的；</li>
<li>为了履行与您订立的合同，维护所提供的产品或服务的安全稳定运行所必需的；</li>
<li>法律法规规定无需征得授权的其他情形。</li>
</ol>
<p>如我们停止运营碳阻迹产品或服务，我们将及时停止继续收集及使用您个人信息的活动，将停止运营的通知以逐一告知或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。</p>
<ol>
<li><strong>我们如何使用 Cookie 和同类技术</strong></li>
</ol>
<p>为确保网站正常运转、为您获得更轻松的访问体验，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。我们不会在Cookie里面存储与个人身份或隐私相关的信息。</p>
<p>您可根据自己的偏好管理或删除 Cookie。有关详情，请参见 AboutCookies.org。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时更改用户设置。如需详细了解如何更改浏览器设置，请访问您使用的浏览器的相关设置页面。</p>
<ol>
<li><strong>我们如何共享、转让和公开披露您的个人信息</strong></li>
<li>共享</li>
</ol>
<p>我们不会与碳阻迹服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：</p>
<ol>
<li>在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。</li>
</ol>
<p>2、在法定情形下的共享：我们可能会根据法律法规规定，或按行政、司法机关依法提出的强制性要求，对外共享您的个人信息。</p>
<p>3、基于向您提供碳阻迹产品/服务需要，于必要的范围内，如后续我们存在与授权合作伙伴共享您的个人信息等安排的，我们会相应更新本政策。</p>
<p>（二）转让</p>
<p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
<p>1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；</p>
<p>2、在碳阻迹服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。</p>
<p>（三）公开披露</p>
<p>我们仅会在以下情况下，公开披露您的个人信息：</p>
<ol>
<li>获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；</li>
</ol>
<p>2、在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。执法机关提出披露要求，我们会及时通知您，除非执法机关另有禁止披露的要求。</p>
<p>（四）共享、转让、公开披露个人信息时事先征得授权同意的例外</p>
<p>以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：</p>
<ol>
<li>与国家安全、国防安全有关的；</li>
<li>与公共安全、公共卫生、重大公共利益有关的；</li>
<li>与犯罪侦查、起诉、审判和判决执行有关的；</li>
<li>您自行向社会公众公开的个人信息；</li>
<li>出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</li>
</ol>
<p>6、其他维护公共利益的情形，例如您的信用评价信息需要被公开/共享；</p>
<p>7、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开渠道，但是您明确拒绝或者处理该信息侵害您重大利益的除外。</p>
<p><strong>根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。</strong></p>
<p>（五）提供证明</p>
<p>对于通过碳阻迹签订的数据电文等法律文件的，碳阻迹有权将前述法律文件的签署信息如当事人姓名或者名称、统一社会信用代码证（或者组织机构代码证）等号码、身份证号码、数字证书号码、IP地址、签订时间等披露给数据电文的签约当事人作为法律文件的签订证据。</p>
<p><strong>四、我们如何保存和保护您的个人信息</strong></p>
<p>（一）个人信息的保存</p>
<p>1、<strong>保存期限：我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非法律法规有强制的留存要求</strong>。我们判断个人信息的存储期限主要参考以下标准并以其中较长者为准：完成与您相关的交易目的、维护相应交易及业务记录，以应对您可能的查询或投诉；保证我们为您提供服务的安全和质量；您是否同意更长的留存期间；是否存在关于保留期限的其他特别约定或法律法规规定。</p>
<p><strong>在超出保留期间后，我们会根据适用法律的要求删除您的个人信息，或使其匿名化处理。在您主动注销账号时，我们将根据法律法规的要求进行数据处理。</strong></p>
<p>2、<strong>保存地域：我们在中华人民共和国境内收集和产生的个人信息，将存储在中国境内，以下情形除外：</strong></p>
<p>（1）法律法规有明确规定；</p>
<p>（2）向您告知境外接收方的相关信息（例如境外接收方的名称、联系方式、处理您个人信息的目的、方式和种类以及您向境外接收方行使您的权利的方式和程序等），并获得您的明确授权。</p>
<p>针对以上情形，我们会确保依据本隐私政策对您的个人信息提供在中华人民共和国境内足够同等的保护。</p>
<p>3、终止运营：如果发生终止运营等情形，我们将会至少提前30天通知您，并在终止运营后对您的个人信息根据法律法规的要求进行处理。</p>
<p>（二）个人信息的保护措施</p>
<p>1、我们已采取符合业界标准的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。在您的浏览器与服务器之间交换数据时受SSL(Secure Socket Layer)协议加密保护；我们同时对碳阻迹网站提供 HTTPS(Hyper Text Transfer Protocol over Secure Socket Layer)协议安全浏览方式；我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</p>
<p>2、我们已经取得以下认证：信息系统安全等级保护三级认证、ISO/IEC 27001信息安全管理体系认证。</p>
<p>3、我们会采取合理可行的措施，避免收集无关的个人信息。<strong>我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。</strong></p>
<p>4、互联网并非绝对安全的环境，<strong>我们强烈建议您不要使用非碳阻迹推荐的通信方式发送个人信息</strong>。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络碳阻迹客服，以便我们根据您的申请采取相应措施。</p>
<p>请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。</p>
<p>5、在不幸发生个人信息安全事件后，我们将按照法律法规的要求及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。事件相关情况我们将以邮件、信函、电话或推送通知的方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。</p>
<p>6、<strong>您通过碳阻迹平台提交个人信息，代表您同意并授权给碳阻迹收集、使用、共享和保护您的个人信息，若您因特殊原因申请撤回授权，请及时联系我们，以便于我们做相应处理。</strong></p>
<p><strong>五、您的权利</strong></p>
<p>您可以通过以下方式访问及管理您的个人信息：</p>
<ol>
<li>访问您的个人信息</li>
</ol>
<p>您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息：</p>
<p>账户信息&mdash;&mdash;如果您希望访问或编辑您的账户中的个人基本信息和更改您的密码、添加安全信息，您可以通过登录账号通过&ldquo;账号管理&rdquo;执行此类操作。</p>
<p>如果您无法通过上述路径访问该个人信息，您可以随时通过碳阻迹客服与我们取得联系。我们将在 30 天内回复您的访问请求。</p>
<p>对于您在使用我们的产品或服务过程中产生的其他个人信息，我们将根据本条&ldquo;(七)响应您的上述请求&rdquo;中的相关安排向您提供。</p>
<ol>
<li>更正或补充您的个人信息</li>
</ol>
<p>当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正或补充。您可以通过&ldquo;（一）访问您的个人信息&rdquo;中列明的方式提出更正或补充申请。</p>
<ol>
<li>删除您的个人信息</li>
</ol>
<p>您可以通过&ldquo;（一）访问您的个人信息&rdquo;中列明的方式删除您的部分个人信息。</p>
<p>在以下情形中，您可以向我们提出删除个人信息的请求：</p>
<p>1、如果我们处理个人信息的行为违反法律法规；</p>
<p>2、如果我们收集、使用您的个人信息，却未征得您的明确同意；</p>
<p>3、如果我们处理个人信息的行为违反了与您的约定；</p>
<p>4、如果您不再使用我们的产品或服务，或您主动注销了账号；</p>
<p>5、如果我们不再为您提供产品或服务。</p>
<p>若我们决定响应您的删除请求，我们还将同时通知从我们处获得您的个人信息的第三方，要求其及时删除，除非法律法规另有规定，或这些第三方获得您的独立授权。</p>
<p><strong>当您从我们的服务中删除信息后，根据法律法规的要求及不同信息的技术条件需要，我们可能无法立即从备份系统中删除相应的信息，在此之前，我们将根据法规要求对相应信息仅进行存储并采取必要的安全保护措施方面的处理。</strong></p>
<ol>
<li>注销账户</li>
</ol>
<p>在需要终止使用碳阻迹产品或服务时，您可以通过本隐私政策列明的联系方式联系我们申请注销碳阻迹账户。</p>
<p>在您主动注销账户之后，我们将停止为您提供产品或服务，根据《中华人民共和国民法典》适用条款删除您的个人信息，或使其匿名化处理。</p>
<p>（五）撤回已同意的授权</p>
<p>您可以通过本隐私政策列明的联系方式联系我们，要求撤回您的已同意的授权。请您注意，撤回已同意的授权后，我们将不再继续处理您相应的个人信息，也无法继续为您提供对应的功能或服务。但您撤回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。</p>
<p>（六）约束信息系统自动决策</p>
<p>在某些业务功能中，我们可能仅依据信息系统、算法在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害碳阻迹商业秘密或其他用户权益、社会公共利益的前提下提供申诉方法。</p>
<p>（七）响应您的上述请求</p>
<p>为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。</p>
<p>在以下情形中，按照法律法规要求，我们将无法响应您的请求：</p>
<p>1、与国家安全、国防安全有关的；</p>
<p>2、与公共安全、公共卫生、重大公共利益有关的；</p>
<p>3、与犯罪侦查、起诉、审判和执行判决有关的；</p>
<p>4、有充分证据表明您存在主观恶意或滥用权利的；</p>
<p>5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</p>
<p>6、涉及商业秘密的。</p>
<p><strong>六、我们如何处理未成年人的个人信息</strong></p>
<p>我们的产品、网站和服务的个人用户、授权用户及授权自然人主要为具备完全民事权利能力和完全民事行为能力的自然人。如果没有父母或监护人的同意，未成年人不得创建自己的用户账户。</p>
<p>对于经父母同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。</p>
<p>尽管当地法律和习俗对未成年人的定义不同，但我们将不满 14 周岁的任何人均视为未成年人。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据或采取适当处理。</p>
<p>若您是未成年人的父母或监护人，如您对本政策所述相关事宜有任何疑问、意见、建议或投诉、举报需求，请通过第八条所述方式与我们进行反馈。</p>
<p><strong>七、本政策如何更新</strong></p>
<p>我们的隐私政策可能变更。</p>
<p>未经您明确同意，我们不会限制您按照本隐私政策所应享有的权利。</p>
<p><strong>我们会通过在我们网站上发出隐私政策更新版本或以其他方式提醒您隐私政策的更新，也请您访问我们以便及时了解最新的隐私政策。在前述情况下，若您继续使用碳阻迹产品/服务，即表示同意接受修订后的隐私政策并受之约束。</strong></p>
<p>对于重大变更，我们还会提供更为显著的通知(包括我们会通过碳阻迹网站公示的方式进行通知)。</p>
<p>本政策所指的重大变更包括但不限于：</p>
<p>1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式；</p>
<p>2、我们在控制权方面发生重大变化。如并购重组引起的所有者变更；</p>
<p>3、个人信息共享、转让或公开披露的主要对象发生变化；</p>
<p>4、您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
<p>5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
<p>6、个人信息安全影响评估报告表明存在高风险时。</p>
<p>我们还会将本政策的旧版本存档，供您查阅。若您在本政策修订后继续使用碳阻迹服务，这表示您已充分阅读、理解并接受修订后的本政策并愿意受修订后的本政策约束。</p>
<p><strong>八、如何联系我们</strong></p>
<p>如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：</p>
<p>电子邮件：<a href="mailto:mail@carbonstop.net">mail</a><em><a href="mailto:mail@carbonstop.net">@carbonstop.com</a></em></p>
<p>Email: mail@carbonstop.com</p>
<p>电话：+86（010）50973498</p>
<p>Phone: +86 (010) 50973498</p>
<p>&nbsp;</p>`;

const agreementList = `<p><strong>服务协议</strong></p><p>更新日期：【2026】年【1】 月【23】日</p><p>生效日期：【2026】年【1】 月【23】日</p><p>                                                                               </p><p><strong>引言</strong></p><p>欢迎您使用我们的产品和服务！本《服务协议》（下称“<strong>本服务协议</strong>”）是您与碳阻迹（北京）科技有限公司（下称“<strong>碳阻迹</strong>”或“<strong>我们</strong>”）之间就注册碳阻迹帐号及使用碳阻迹的各项产品及服务（下称“<strong>本服务</strong>”）等相关事宜所订立的协议。为使您获得愉悦的使用体验，请您务必审慎阅读、充分理解本服务协议条款内容，<strong>免除或者限制责任的条款将以粗体或下划线标识，你应重点阅读。如你对协议有任何疑问，可向碳阻迹咨询。</strong></p><p><strong>定义</strong></p><ol><li><strong>碳阻迹：</strong>指研发并提供碳阻迹产品和服务的碳阻迹（北京）科技有限公司及现在或未来设立的相关关联公司的单称或合称。</li><li><strong>碳阻迹服务/本服务：</strong>是指由碳阻迹开发和服务的组织碳核算、产品碳足迹、绿色会议、碳账户、碳中和、碳认证、AI Agent、工作台等<strong>碳云SaaS产品</strong>；为本服务协议之目的，AI Agent是指由碳阻迹以网页、应用程序（可能含不同版本）、浏览器插件、供第三方网站和应用程序使用软件开发工具包（SDK）、应用程序编程接口（API）等以及随技术发展出现的创新形态方式向您提供的以生成式人工智能服务为核心的产品与服务（“<strong>AI Agent</strong>”）。无论“产品/服务”属于上述何种情形，本《服务协议》都将予以适用。</li><li><strong>碳阻迹网站：</strong>碳阻迹为用户提供服务的互联网网址为官网(www.carbonstop.com)、碳云SaaS (saas.carbonstop.com)。</li></ol><p><strong>4、用户（以下或称为“您”）：</strong>包括个人用户及客户，其中（1）个人用户，指相对授权用户，以个人身份注册和使用本服务的自然人；（2）客户，指通过授权自然人注册本服务帐号，享有管理权限的法人或其他组织，客户可以邀请个人加入其组织成为其授权用户；授权用户，指被客户授权或邀请加入，并使用本服务的自然人。</p><p><strong>特别提示</strong></p><p>1、<strong>如您在注册登录时勾选“我已阅读并同意《服务协议》”并通过注册程序或其他任何方式使用或接受本服务，即视为您已阅读并同意本服务协议内容，自愿接受本服务协议的所有内容的约束。如您不同意本服务协议的任意内容，请勿注册或使用本服务，并应立即停止注册程序。</strong>如您对本服务协议的内容（特别是涉及免除或者责任限制的条款）有任何疑义，可随时按照本服务协议中列明的联系方式与我们联系，我们将根据您的要求为您进一步解释和说明相关内容。</p><p>2、<a id="_Hlk149841299"></a><strong>基于业务功能、使用规则、法律法规及监管要求、更好的提供服务、经营策略等原因，</strong>本协议可能变更，碳阻迹对本协议内容进行的重大变更，我们会提供显著的通知(包括我们会通过碳阻迹网站公示的方式进行通知)。<strong>修改后的协议及规则自公布后即时生效。我们还会将本服务协议的旧版本存档，供您查阅。若您在本服务协议修订后继续使用碳阻迹服务，这表示您已充分阅读、理解并接受修订后的本服务协议并愿意受修订后的本服务协议约束。</strong></p><p>3、<strong>为使您能够享受本服务的功能，我们会在遵守相关法律法规的情况下，收集、使用、共享您信息，我们仅根据客户要求处理您的信息，且不对该客户的相关行为承担法律责任。您的个人信息及相关处理请您详细查阅《隐私政策》</strong>。</p><p>4、<strong>当您注册本服务的帐号后，您可以使用本服务提供的部分功能；当您订阅购买产品服务或接受其他客户组织邀请后，您将获得本服务对应的全部功能。</strong></p><p>5、<strong>本服务及相关衍生服务的所有权、运作权及有关权益归我们所有。</strong></p><p>6、<strong>您在使用供应链相关应用服务时，将通过邮箱的方式向供应商发送邀请链接，供应商可使用本服务与您建立绑定，并且在同意的情况下向您分享碳数据结果，包含但不限于：企业基本信息、碳排放量、碳排放量强度、电力使用信息等，该信息我们会根据数据变化调整，我们不做数据调整保证，也不为此承担任何责任。</strong></p><p><strong>服务协议明细</strong></p><p><strong>一、帐号注册和使用规范</strong></p><p><strong>Account Registration and Usage Guidelines</strong></p><p>1、使用本服务的个人用户、授权用户及授权自然人主要为具备完全民事权利能力和完全民事行为能力的自然人。如果没有父母或监护人的同意，未成年人不得以任何名义创建帐户。<strong>如果您未满18周岁，请务必在家长和其他法定监护人的陪同下阅读本服务协议，并在进行注册等任何行为或使用本服务，事先征得您的家长和其他法定监护人的同意。</strong></p><p>2、<strong>如果你是非中国大陆地区的用户，你订立或履行本协议以及使用本服务的行为还需要同时遵守你所属和/或所处国家或地区的法律。</strong></p><p>3、您可以通过本服务提供的注册界面，根据页面提示填写信息、阅读并同意本服务协议且完成全部注册程序后，你可获得本服务帐号并成为本服务用户。</p><p>4、使用<strong>同一手机号</strong>或经碳阻迹排查认定多个碳云帐号的实际控制人为同一人的，均视为同一用户。</p><p>5、您应当通过真实身份信息认证注册帐号，且您提交的帐号名称、头像、 简介等注册信息中不得出现违法和不良信息，如存在上述情况，碳阻迹将不予注册；<strong>同时，在注册后，如发现你以虚假信息骗取帐号名称注册，或帐号头像、简介等注册信息存在违法/不良信息的，或侵犯他人合法权益的，碳阻迹可采取限期改正、暂停使用、注销登记、收回等措施。</strong></p><p>6、<strong>您有权使用手机号或邮箱登录本服务，获得帐号并自行设置符合安全要求的密码，</strong>您的帐号由您自行保管，碳阻迹任何时候均不会主动要求您提供您的帐号密码。因此，请您务必保管好您的帐号，并确保您在每个上网时段结束时退出登录并以正确步骤离开本服务。<strong>帐号因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，碳阻迹并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。</strong></p><p>7、<strong>由于您的碳云帐号关联您的个人信息及业务信息，请确保您的帐号仅限您本人使用，以保证帐号的安全性和私密性。您应对您帐号项下的所有行为结果（包括但不限于企业信息填写、业务数据填写、购买商品/服务及披露信息等）负责，但碳阻迹存在过错的除外。</strong></p><p>8、<strong>如发现任何未经授权使用您帐号登录碳云或其他可能导致您帐号遭窃、遗失的情况，建议您立即通知碳阻迹客服。您应理解碳阻迹对您的任何请求采取行动均需要合理时间，且碳阻迹应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除碳阻迹存在法定过错外，碳阻迹不承担责任。</strong></p><p>9、由于用户帐号关联用户个人及企业信息，当符合碳云用户帐号转让流程的情况下，您可进行帐号的转让。您的帐号一经转让，该帐号项下权利义务一并转移。<strong>除此外，您的帐号不得以任何方式转让，否则碳阻迹有权追究您的违约责任，且由此产生的责任及后果均由您自行承担。</strong></p><p>10、因您个人原因导致的帐号信息遗失，如需找回帐号信息，请按照帐号找回要求提供相应的信息，并确保提供的信息合法真实有效，若提供的信息不符合要求，无法通过安全验证，碳阻迹有权拒绝提供帐号找回服务；若帐号的唯一凭证不再有效，碳阻迹有权拒绝支持帐号找回，例如手机号二次出售，碳阻迹可拒绝支持帮助找回原手机号绑定的帐号。</p><p>11、在需要终止使用本服务时，您可以向碳阻迹客服提出注销申请。若您是授权用户，您可以向您所在的企业或组织提交退出团队申请并注销帐号，由客户管理员处理。在您的帐号被注销前，我们将验证您的个人身份、安全状态、设备信息等信息，您知悉并理解，注销帐号的行为是不可逆的行为，<strong>在注销帐户之后，我们将停止为您提供服务，并依据您的要求，删除您的个人信息或对您的个人信息进行匿名化处理，但法律法规另有规定的除外。</strong></p><p>12、若您在本服务注册、使用期间存在违反法律规定的情形，<strong>我们保留在您违反适用法律法规规定或违反本协议的情况下冻结、注销您的帐号并删除或匿名化处理您所存储的数据、信息的权利，且无需为此向您承担任何责任，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。</strong></p><p><strong>二、服务内容及使用规范</strong></p><ol><li><strong>您具体享受的服务周期，将从您实际购买相应产品/服务之日起算。</strong></li><li>您可使用本服务进行碳相关业务计算及数据管理，您需保证您使用本服务上传的模型、数据、附件、产品、服务的安全性、稳定性、有效性，不存在病毒、蠕虫、木马及其他有害的计算机的代码、文件、脚本和程序，不会对我们的相关系统及数据造成损害。由于您的内容引起的安全漏洞，包括但不限于病毒、木马、蠕虫或其他有害程序，或由于您未按照本协议约定使用服务而引起的安全漏洞，由您自行负责并承担责任，如造成我们损失或损失风险的，我们有权向您主张损害赔偿责任。</li><li><strong>CCDB 碳数据库使用说明：</strong><ul class="ccdbUsageList"><li>用户可在服务有效期和授权范围内使用 CCDB 进行因子检索。应根据核算目的核对因子的单位、地区、年份、技术类型、来源和版本等，并对因子的选择及核算结果负责。CCDB 提供的因子推荐和匹配结果仅供参考，不替代法律法规、标准、产品种类规则、行业指南、监管、客户或认证机构的要求。</li><li>未经碳阻迹书面许可，用户不得批量抓取、复制、导出、出售、转让、再分发 CCDB 数据，也不得利用 CCDB 数据建立相同或实质相似的数据库或数据服务。</li></ul></li><li><strong>AI Agent是碳阻迹主要依托自研Carbon AI微调模型和CCDB碳数据库、并可能同时依托于其他模型或数据库而为用户所提供的产品碳核算领域的生成式人工智能技术服务及其他技术服务。用户需在对话框中输入文本信息，AI Agent会基于您的输入输出相应的内容作为响应，输出内容包括但不限于数据建模及核算结果等。</strong></li></ol><p>随着生成式人工智能的技术、模型和产品的不断迭代发展以及法律、法规的变化，我们可能对AI Agent服务进行新增、升级、变更、中止或终止，或对AI Agent服务的技术、方式、性能等进行必要的调整，并可能针对新增服务功能开展内部或外部测试。</p><p>您充分理解并同意，依据本协议，我们授予您一项可撤销的、不可转让的和非独占地合法使用本服务及相关产品的权利。本协议未明示授权的其他一切权利仍由碳阻迹保留，您在行使该些权利前须另行获得碳阻迹的书面许可，同时碳阻迹如未行使前述任何权利，并不构成对该权利的放弃。<strong>您应当：（1）主动核查AI Agent相关服务输出内容的真实性、准确性，避免传播虚假信息；（2）避免发布和传播任何违反本协议使用规范的输出内容。</strong></p><ol><li>通过使用我们的服务，您承认并同意如下内容：</li></ol><p>（1）您对提交给我们服务的所有输入和对应的输出负责。<strong>您声明并保证，就您向我们的服务提交的输入，您拥有根据我们的条款处理输入所需的所有权利、许可和权限，这些输入和对应的输出不侵犯任何人的知识产权、肖像权、名誉权、荣誉权、姓名权、隐私权、个人信息权益等合法权益，不涉及任何国家秘密、商业秘密或其他可能会对国家安全或者公共利益造成不利影响的数据。</strong></p><p><strong>（2）AI Agent相关服务提供的所有输出均由碳阻迹自研的人工智能模型生成，不构成碳阻迹在法律上的意思表示，您知悉该等内容可能偶尔会出现错误或遗漏；AI Agent相关服务的输出不应成为您进一步作为或不作为的依据。您有责任根据您的具体需求来评估AI Agent所输出内容的准确性和适当性，包括在应用或传播本服务的输出之前，您应视情况进行人工审查。您根据AI Agent相关服务输出的内容所作出的任何判断或者据此作出的后续相关操作行为，所带来的后果和责任均由您自行承担，包括因对输出的内容的真实性、准确性、可靠性、不侵权或满足特定目的的依赖而产生的风险。</strong></p><p><strong>（3）对于碳阻迹通过人工智能技术生成、合成的文本、图片等内容（包括但不限于AI Agent所生成的内容），我们有权基于法律法规的要求添加人工智能生成标识，包括在生成、合成内容或者交互场景界面中添加用户可明显感知的显式标识，以及在生成、合成内容的文件元数据中添加隐式标识（合称“AI标识”）。您不得利用基于生成式人工智能等新技术和新应用制作、发布、传播虚假、不实、侵权等违反法律法规的信息。</strong></p><p><strong>（4）本服务可能偶尔会生成不完整、不正确或具有潜在冒犯性的输出，这不应该被解释为反映我们的观点或立场。此外，输出中对第三方产品或服务的任何引用并不意味着我们的认可或与我们有关联。</strong></p><ol><li><strong>为向您提供连续、高质量的服务，在经安全加密技术处理、严格去标识化且无法重新识别特定个人的前提下，我们可能会将服务所收集的输入及对应输出，用于模型训练和服务的优化。在此前提下，您同意授予碳阻迹在全球范围内一项免费的、非排他的许可使用权，以使我们对前述内容进行处理。</strong></li><li>为履行法定义务的要求，碳阻迹有权采取技术手段等措施对用户使用本服务的行为及信息进行审查，包括但不限于对输入和输出进行审查、建立风险过滤机制、建立违法内容特征库等。作为本服务的使用者，<strong>您不得通过以下方式恶意对抗本服务的信息内容安全管理和风险防范机制，包括但不限于</strong>：</li></ol><p>（1）恶意对抗行为，包括但不限于使用变体、乱码、字符、谐音等方式规避服务检测来输入或生成违反法律法规等相关规定的言论；</p><p>（2）通过假扮身份、反向诱导、越狱攻击等方式进行恶意攻击、诱导和投毒。</p><p>（3）未经碳阻迹同意或未有合法正当依据，擅自去除、篡改本服务涉及的生成内容标识</p><ol><li>若您为企业管理员，您可启用或禁用授权用户对本服务的访问权限。企业用户的选择和决定可能会使您的部分或全部用户内容被访问、使用、披露、修改、限制使用或删除。如果您代表客户使用本服务，您确认客户将事先向其授权用户就此情况进行充分说明，并取得授权用户的明确同意。</li></ol><p><strong>三、隐私、帐号及密码的保护</strong></p><p>1、碳阻迹非常重视用户的个人信息和隐私的保护，《隐私政策》为本服务协议的一部分。碳阻迹将按照《隐私政策》中所公布的政策在本服务中进行隐私及个人信息的收集、存储、使用、披露等活动。用户在使用本服务前，应仔细阅读《隐私政策》。</p><p>2、各方应就本服务协议内容，以及本服务协议签署和履行过程中所获知的另一方保密信息（指另一方尚未通过公开途径披露的任何信息，包括用户使用本服务保存在碳阻迹服务器上的数据、开发服务内容、成果、相关文件、资料等）严格保密，未经对方事先书面同意，不得向任何第三方泄露保密信息，但由于法律的适用、法院或应国家有权机关的要求而披露的除外。</p><p>3、用户应就登录密码采取保密措施，碳阻迹不会以任何方式向用户索要登录密码，用户不得向其他任何第三方透露登陆密码，否则用户可能需对碳阻迹及本服务的任何其他用户或访问者因此所遭受的损失承担责任。</p><p>4、本服务协议终止后，本保密条款继续有效。任何一方违反任何保密义务的，应当赔偿由此给对方造成的损失。</p><p><strong>四、知识产权</strong></p><p>1、除另有说明外，本服务所载的内容为碳阻迹的财产，表现形式包括但不限于文本、图像、数据、信息、软件、图形、照片、观点、建议、网页等。碳阻迹可随时更改本服务上的内容，而无需通知。碳阻迹将尽可能提供准确的数据结果，但我们对信息的准确性和完整性不承担任何义务或责任。为方便您的使用，本服务可能包含指向第三方网站的链接，但包含链接并不意味着此类网站或其中提供的产品或服务的任何认可，也不保证所提供信息的有效性。</p><p>2、碳阻迹完全拥有碳云软件及本服务的全部知识产权（包括但不限于商标权、著作权、专利权、商业秘密等），您仅基于本服务协议取得有限的使用权。碳阻迹碳云软件及本服务的名称、LOGO、商业标识等相关权利均归属于碳阻迹，未经碳阻迹授权，您不得使用或授权第三方使用。您同意经碳阻迹授权后使用本服务内容时注明内容来源为“碳阻迹”。</p><p>3、如因碳阻迹原因出现与碳云软件有关的第三方指控或知识产权侵权等事件，我们负责解决。但因如下情况引起的第三方指控或侵权等事件、以及由此产生的一切责任均由用户自行承担，碳阻迹不承担任何责任：</p><ul><li>当最新版本的碳云软件已向用户提供，而使用这种最新版本的软件又能避免上述指控或侵权事件，但用户还采用其他版本；</li><li>用户将碳云软件与其他的软件、程序或数据一起使用导致上述指控或侵权事件发生；</li><li>未经碳阻迹事先同意，用户自行对碳云软件进行修改、改编、反编译、反汇编等任何形式的处理而导致的指控或侵权事件。</li></ul><p><strong>五、服务协议终止</strong></p><p>1、除本服务协议其他条款约定外，本服务协议还可因下列情形终止：</p><ul><li>经双方协商一致，本服务协议可提前终止；</li><li>一方发生违约行为，且经对方催告后未能在5日内纠正违约行为并消除违约影响；</li><li>如一方成为申请破产主体，或成为任何其它资不抵债、接管、清算等程序的对象，则另一方有权解除本服务协议；</li><li>如因不可抗力事件影响导致一方或双方无法履行本服务协议项下义务且持续时间超过30日，则任何一方有权解除本服务协议；</li><li>碳阻迹收回、注销用户帐号，此情形下，本服务协议于帐号收回、注销之日终止；</li><li>在满足帐号注销条件时，用户注销帐号，本服务协议于帐号注销之日终止；</li><li>碳阻迹有权根据自身商业安排经过合理的提前通知终止本服务，本服务协议于本服务依法定程序及方式终止之日终止。</li></ul><p>2、本服务协议终止后，碳阻迹将无法继续向用户提供任何服务或履行任何其他义务，包括但不限于为用户保留或向用户披露其帐号中的任何信息等。</p><p>3、本服务协议的终止不影响知识产权条款以及其他根据其内容应继续有效的条款的有效性，也不影响本服务协议终止前各方的相关权利和义务，包括但不限于守约方依据本服务协议向违约方追究相应的违约责任。</p><p><strong>六、服务声明</strong></p><p><strong>碳阻迹对下列事项不作陈述与保证：</strong></p><ul><li><strong>碳阻迹尽可能向用户提供正常稳定的碳云软件服务，但在碳云软件与用户所使用的特定软件和硬件（如系统、手机、电脑）发生了不兼容或者报错等情形，碳阻迹不能保证上述情形不会发生；</strong></li><li><strong>鉴于碳云软件服务是标准化的软件服务，碳阻迹不能保证根据用户的个性化要求对碳云软件服务进行特别的修正。</strong></li><li><strong>碳云软件是通过标准化的计算模型产生结果，碳阻迹不能保证结果或报告的绝对准确或不具有任何误导性，亦不承担用户以任何方式使用该等结果或报告所产生的一切责任或义务，包括但不限于因该等结果或报告的合理误差、遗漏或其他问题产生的责任或义务。</strong></li><li><strong>限于技术特性，不保证AI Agent相关服务生成内容的合法性、真实性、完整性、准确性、及时性及实用性，不排除通过用户输入内容恶意诱导等违反本服务协议的使用方式/目的可能输出的包含与碳阻迹观点不一致的内容。不保证AI Agent相关服务能满足用户的所有要求。</strong></li><li><strong>当本服务提供的内容包含来自插件、第三方网站等内容时，我们并不对这些内容的有效性负责，且不保证从这些途径获取的任何内容、产品、服务或其他材料的真实性、合法性、安全性。</strong></li><li><strong>在适用法律法规所允许的最大范围内，碳阻迹不就因使用或不能使用本服务所引起的或有关的任何间接的、意外的、特殊的、惩罚性的或其它任何损害（包括但不限于因人身伤害或财产损坏而造成的损害，因利润损失、数据损失、营业中断、计算机瘫痪或故障、商业信息的遗失而造成的损害）承担赔偿责任。</strong></li></ul><p><strong>七、第三方内容的使用</strong></p><p>1、本服务可能包含或向用户提供第三方内容，如ecoinvent等数据库授权使用的数据等。<strong>碳阻迹不对任何此类第三方内容作出任何形式的陈述或保证，也不对任何第三方内容造成的任何性质或种类的损失、损害、费用或成本承担任何责任。</strong></p><p>2、用户如需使用ecoinvent数据库授权使用的数据，只能在本服务协议服务期内使用，且不得对该部分数据进行复制、改编、更改、翻译、修改、分许可、销售、转让、分发、反编译、反汇编及反向计算等。该部分数据的使用受到ecoinvent数据库使用条款的约束（详见<a href="https://ecoinvent.org/the-ecoinvent-database/terms-of-use/">https://ecoinvent.org/the-ecoinvent-database/terms-of-use/</a>）。</p><p>3、<strong>为执行碳阻迹与ecoinvent之间的许可协议和备份目的，用户在此同意碳阻迹收集用户的名称（姓名）、联系人姓名和电子邮件、协议有效期等信息报告给ecoinvent</strong>。</p><p><a id="_Hlk149810927"></a><strong>八、通知</strong></p><p>1、有效联系方式</p><p>您在注册或使用碳阻迹服务时，您应该向碳阻迹提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被有效联系的状态。</p><p>您用于登陆碳阻迹平台、接收站内信、系统消息等即时信息的账号，也作为您的有效联系方式。</p><p>碳阻迹公司将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</p><p>2、通知的送达</p><p>碳阻迹通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在碳阻迹官网平台公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</p><p>您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。</p><p>您可通过以下方式与我们联系：</p><p>电子邮件：<a href="mailto:mail@carbonstop.net">mail@carbonstop.com</a></p><p>电话：+86（010）50973498</p><p><strong>九、违约责任</strong></p><p>1、违约认定</p><p>发生如下情形之一的，视为您违约：</p><ol><li>使用碳阻迹产品或服务时违反有关法律法规规定的；</li><li>违反本协议、关联协议或者与碳阻迹签署的其他协议约定的。</li></ol><p>2、违约处理措施</p><p>您在碳阻迹平台上发布的信息构成违约的，碳阻迹可根据相应平台规则立即对相应信息进行删除、屏蔽处理。</p><p>您在碳阻迹平台上实施的行为，或虽未在碳阻迹平台上实施但对碳阻迹及其用户产生影响的行为构成违约的，碳阻迹可依据相应平台规则对您执行中止向您提供部分或全部产品或服务等处理措施。如您的行为构成根本违约的，碳阻迹可关闭您的账号，终止向您提供产品或服务。</p><p>当您违约的同时存在欺诈、售假、盗用他人账号等特定情形或您存在危及他人账号安全风险时，碳阻迹会依照您行为的风险程度对您的账号采取关闭、注销等强制措施。</p><p>碳阻迹可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在碳阻迹平台上予以公示。</p><p>3、赔偿责任</p><p><strong>若因您利用我们的服务进行的活动，导致与第三方（包括但不限于任何访问和使用您应用与内容的用户（“最终用户”））间存在直接争议，则该等争议由您与第三方自行解决并承担相应法律责任，由此给我们带来损失的，您应承担赔偿责任。</strong></p><p>如您的行为使碳阻迹遭受损失，您应根据本协议履行赔偿责任，您需赔偿碳阻迹的因此遭受的损失（如有）包括:</p><p>支付的合理律师费、诉讼费、消除影响所支出的必要费用；</p><p>因行政处罚、司法裁判、法定标准范围内的调解等对外支出的罚款、违约金或赔偿金；</p><p>商誉损失、合理预期利益损失（如经营收入减少等），具体金额可以第三方独立合理分析、碳阻迹根据大数据合理分析及其他计算收益、损失的合理方法所得出的相关估算标准作为计算依据；因此遭受的其他损失。</p><p>如您的行为使碳阻迹遭受第三人主张权利，碳阻迹可在对第三人承担金钱给付等义务后就全部损失向您追偿。</p><p>碳阻迹因故意或重大过失违约导致您利益受损的，碳阻迹将以您的直接实际损失为计算依据向您履行赔偿责任。除非本服务相关界面另有说明，或您与我们另有约定，或法律有明确规定，我们不对由于使用本服务给您引起的损害承担责任。</p><p><strong>十、争议解决及其他</strong></p><p>1、本服务协议适用中华人民共和国（为本服务协议之目的，不含香港特别行政区、澳门特别行政区、台湾）法律。</p><p>2、因履行本服务协议所发生的一切争议，双方应通过友好协商解决；协商不成时，任何一方均可向碳阻迹所在地有管辖权的人民法院提起诉讼。</p><p style="height:20px"></>`;

const Agreement = () => {
  const history = useHistory();
  const { location } = history;
  return location.search ? (
    // 服务协议
    <div className='agreement'>
      <div
        className='contents'
        dangerouslySetInnerHTML={{ __html: agreementList }}
      />
    </div>
  ) : (
    <div className='agreement'>
      <div className='contents' dangerouslySetInnerHTML={{ __html: newList }} />
    </div>
  );
};
export default Agreement;
